experiments/results/baseline-jaeger/raw/20260623_224854_read-home-timeline_R700_t4_c40_d60.txt
# workload=read-home-timeline
# rate=700
# threads=4
# connections=40
# duration=60
# timestamp=20260623_224854

Running 1m test @ http://localhost:8080/wrk2-api/home-timeline/read
  4 threads and 40 connections

  Thread calibration: mean lat.: 30.233ms, rate sampling interval: 152ms
  Thread calibration: mean lat.: 29.397ms, rate sampling interval: 150ms
  Thread calibration: mean lat.: 23.617ms, rate sampling interval: 146ms
  Thread calibration: mean lat.: 27.564ms, rate sampling interval: 176ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    17.24ms   51.30ms 258.05ms   94.96%
    Req/Sec   174.23     33.57   262.00     71.31%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.76ms
 75.000%    7.92ms
 90.000%   29.39ms
 99.000%  258.05ms
 99.900%  668.16ms
 99.990%  890.37ms
 99.999%  938.49ms
100.000%  938.49ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.305     0.000000            1         1.00
       3.389     0.100000         3483         1.11
       3.673     0.200000         6972         1.25
       3.955     0.300000        10463         1.43
       4.291     0.400000        13924         1.67
       4.755     0.500000        17419         2.00
       5.067     0.550000        19160         2.22
       5.451     0.600000        20903         2.50
       5.979     0.650000        22638         2.86
       6.731     0.700000        24365         3.33
       7.919     0.750000        26109         4.00
       8.879     0.775000        26976         4.44
      10.319     0.800000        27848         5.00
      12.791     0.825000        28715         5.71
      16.415     0.850000        29586         6.67
      21.711     0.875000        30456         8.00
      25.327     0.887500        30894         8.89
      29.407     0.900000        31326        10.00
      35.231     0.912500        31761        11.43
      43.167     0.925000        32197        13.33
      53.951     0.937500        32631        16.00
      60.895     0.943750        32849        17.78
      68.991     0.950000        33066        20.00
      79.615     0.956250        33285        22.86
      91.839     0.962500        33502        26.67
     111.807     0.968750        33719        32.00
     123.071     0.971875        33828        35.56
     134.911     0.975000        33936        40.00
     150.527     0.978125        34045        45.71
     172.543     0.981250        34154        53.33
     196.991     0.984375        34263        64.00
     212.223     0.985938        34318        71.11
     232.319     0.987500        34371        80.00
     250.111     0.989062        34426        91.43
     269.311     0.990625        34480       106.67
     302.335     0.992188        34535       128.00
     316.415     0.992969        34562       142.22
     327.935     0.993750        34589       160.00
     350.207     0.994531        34616       182.86
     379.903     0.995313        34643       213.33
     411.903     0.996094        34671       256.00
     430.591     0.996484        34684       284.44
     448.767     0.996875        34698       320.00
     466.943     0.997266        34711       365.71
     506.111     0.997656        34725       426.67
     527.871     0.998047        34739       512.00
     545.791     0.998242        34745       568.89
     558.079     0.998437        34752       640.00
     587.263     0.998633        34759       731.43
     624.127     0.998828        34767       853.33
     674.815     0.999023        34773      1024.00
     685.055     0.999121        34776      1137.78
     715.263     0.999219        34779      1280.00
     724.479     0.999316        34783      1462.86
     739.327     0.999414        34786      1706.67
     764.927     0.999512        34790      2048.00
     770.559     0.999561        34791      2275.56
     779.263     0.999609        34793      2560.00
     782.847     0.999658        34795      2925.71
     803.327     0.999707        34796      3413.33
     821.759     0.999756        34798      4096.00
     822.783     0.999780        34799      4551.11
     828.927     0.999805        34800      5120.00
     837.631     0.999829        34801      5851.43
     837.631     0.999854        34801      6826.67
     875.519     0.999878        34802      8192.00
     890.367     0.999890        34803      9102.22
     890.367     0.999902        34803     10240.00
     925.695     0.999915        34804     11702.86
     925.695     0.999927        34804     13653.33
     925.695     0.999939        34804     16384.00
     931.839     0.999945        34805     18204.44
     931.839     0.999951        34805     20480.00
     931.839     0.999957        34805     23405.71
     931.839     0.999963        34805     27306.67
     931.839     0.999969        34805     32768.00
     938.495     0.999973        34806     36408.89
     938.495     1.000000        34806          inf
#[Mean    =       17.237, StdDeviation   =       51.296]
#[Max     =      937.984, Total count    =        34806]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  41783 requests in 1.00m, 579.44MB read
Requests/sec:    696.18  
Transfer/sec:      9.65MB

# docker compose ps
NAME                                     IMAGE                                                COMMAND                  SERVICE                  CREATED        STATUS       PORTS
socialnetwork-compose-post-service-1     deathstarbench/social-network-microservices:latest   "ComposePostService"     compose-post-service     11 hours ago   Up 2 hours   
socialnetwork-home-timeline-redis-1      redis                                                "docker-entrypoint.s…"   home-timeline-redis      11 hours ago   Up 2 hours   6379/tcp
socialnetwork-home-timeline-service-1    deathstarbench/social-network-microservices:latest   "HomeTimelineService"    home-timeline-service    11 hours ago   Up 2 hours   
socialnetwork-jaeger-agent-1             jaegertracing/all-in-one:1.62.0                      "/go/bin/all-in-one-…"   jaeger-agent             11 hours ago   Up 2 hours   4317-4318/tcp, 5775/udp, 5778/tcp, 9411/tcp, 14250/tcp, 14268/tcp, 6831-6832/udp, 0.0.0.0:16686->16686/tcp, [::]:16686->16686/tcp
socialnetwork-media-frontend-1           yg397/media-frontend:xenial                          "/usr/local/openrest…"   media-frontend           11 hours ago   Up 2 hours   0.0.0.0:8081->8080/tcp, [::]:8081->8080/tcp
socialnetwork-media-memcached-1          memcached                                            "docker-entrypoint.s…"   media-memcached          11 hours ago   Up 2 hours   11211/tcp
socialnetwork-media-mongodb-1            mongo:4.4.6                                          "docker-entrypoint.s…"   media-mongodb            11 hours ago   Up 2 hours   27017/tcp
socialnetwork-media-service-1            deathstarbench/social-network-microservices:latest   "MediaService"           media-service            11 hours ago   Up 2 hours   
socialnetwork-nginx-thrift-1             yg397/openresty-thrift:xenial                        "/usr/local/openrest…"   nginx-thrift             11 hours ago   Up 2 hours   0.0.0.0:8080->8080/tcp, [::]:8080->8080/tcp
socialnetwork-post-storage-memcached-1   memcached                                            "docker-entrypoint.s…"   post-storage-memcached   11 hours ago   Up 2 hours   11211/tcp
socialnetwork-post-storage-mongodb-1     mongo:4.4.6                                          "docker-entrypoint.s…"   post-storage-mongodb     11 hours ago   Up 2 hours   27017/tcp
socialnetwork-post-storage-service-1     deathstarbench/social-network-microservices:latest   "PostStorageService"     post-storage-service     11 hours ago   Up 2 hours   0.0.0.0:10002->9090/tcp, [::]:10002->9090/tcp
socialnetwork-social-graph-mongodb-1     mongo:4.4.6                                          "docker-entrypoint.s…"   social-graph-mongodb     11 hours ago   Up 2 hours   27017/tcp
socialnetwork-social-graph-redis-1       redis                                                "docker-entrypoint.s…"   social-graph-redis       11 hours ago   Up 2 hours   6379/tcp
socialnetwork-social-graph-service-1     deathstarbench/social-network-microservices:latest   "SocialGraphService"     social-graph-service     11 hours ago   Up 2 hours   
socialnetwork-text-service-1             deathstarbench/social-network-microservices:latest   "TextService"            text-service             11 hours ago   Up 2 hours   
socialnetwork-unique-id-service-1        deathstarbench/social-network-microservices:latest   "UniqueIdService"        unique-id-service        11 hours ago   Up 2 hours   
socialnetwork-url-shorten-memcached-1    memcached                                            "docker-entrypoint.s…"   url-shorten-memcached    11 hours ago   Up 2 hours   11211/tcp
socialnetwork-url-shorten-mongodb-1      mongo:4.4.6                                          "docker-entrypoint.s…"   url-shorten-mongodb      11 hours ago   Up 2 hours   27017/tcp
socialnetwork-url-shorten-service-1      deathstarbench/social-network-microservices:latest   "UrlShortenService"      url-shorten-service      11 hours ago   Up 2 hours   
socialnetwork-user-memcached-1           memcached                                            "docker-entrypoint.s…"   user-memcached           11 hours ago   Up 2 hours   11211/tcp
socialnetwork-user-mention-service-1     deathstarbench/social-network-microservices:latest   "UserMentionService"     user-mention-service     11 hours ago   Up 2 hours   
socialnetwork-user-mongodb-1             mongo:4.4.6                                          "docker-entrypoint.s…"   user-mongodb             11 hours ago   Up 2 hours   27017/tcp
socialnetwork-user-service-1             deathstarbench/social-network-microservices:latest   "UserService"            user-service             11 hours ago   Up 2 hours   
socialnetwork-user-timeline-mongodb-1    mongo:4.4.6                                          "docker-entrypoint.s…"   user-timeline-mongodb    11 hours ago   Up 2 hours   27017/tcp
socialnetwork-user-timeline-redis-1      redis                                                "docker-entrypoint.s…"   user-timeline-redis      11 hours ago   Up 2 hours   6379/tcp
socialnetwork-user-timeline-service-1    deathstarbench/social-network-microservices:latest   "UserTimelineService"    user-timeline-service    11 hours ago   Up 2 hours